MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C12D0AGV20000/mcu.h
/*******************************************************************************
* MFSI2S_MODULE
*******************************************************************************/
typedef struct stc_mfsi2s_cntlreg_field
{
        __IO  uint16_t  FRAML                    :1;
        __IO  uint16_t  RESERVED0                :2;
        __IO  uint16_t  I2SMOD                   :1;
        __IO  uint16_t  FSPL                     :1;
        __IO  uint16_t  I2SEN                    :1;
        __IO  uint16_t  CKOE                     :1;
        __IO  uint16_t  RESERVED1                :1;
        __IO  uint16_t  MSKB                     :1;
        __IO  uint16_t  RESERVED2                :1;
        __IO  uint16_t  I2SRUN                   :1;
        __IO  uint16_t  RESERVED3                :5;
} stc_mfsi2s_cntlreg_field_t;

typedef struct stc_mfsi2s_i2sclk_field
{
    union {
        struct {
            __IO  uint16_t  I2SDIV               :8;
            __IO  uint16_t  RESERVED0            :6;
            __IO  uint16_t  MCKOE                :1;
            __IO  uint16_t  MCKIE                :1;
        };
        struct {
            __IO  uint16_t  I2SDIV0              :1;
            __IO  uint16_t  I2SDIV1              :1;
            __IO  uint16_t  I2SDIV2              :1;
            __IO  uint16_t  I2SDIV3              :1;
            __IO  uint16_t  I2SDIV4              :1;
            __IO  uint16_t  I2SDIV5              :1;
            __IO  uint16_t  I2SDIV6              :1;
            __IO  uint16_t  I2SDIV7              :1;
            __IO  uint16_t  RESERVED1            :8;
        };
    };
} stc_mfsi2s_i2sclk_field_t;

typedef struct stc_mfsi2s_i2srst_field
{
    union {
        struct {
            __IO   uint8_t  I2SRST               :8;
        };
        struct {
            __IO   uint8_t  I2SRST0              :1;
            __IO   uint8_t  I2SRST1              :1;
            __IO   uint8_t  I2SRST2              :1;
            __IO   uint8_t  I2SRST3              :1;
            __IO   uint8_t  I2SRST4              :1;
            __IO   uint8_t  I2SRST5              :1;
            __IO   uint8_t  I2SRST6              :1;
            __IO   uint8_t  I2SRST7              :1;
        };
    };
} stc_mfsi2s_i2srst_field_t;

typedef struct stc_mfsi2s_i2sst_field
{
        __IO   uint8_t  CKSTP                    :1;
        __IO   uint8_t  BUSY                     :1;
        __IO   uint8_t  RESERVED0                :6;
} stc_mfsi2s_i2sst_field_t;

/*******************************************************************************
* MTB_DWT_MODULE
*******************************************************************************/
typedef struct stc_mtb_dwt_cmp_addr_start_field
{
    union {
        struct {
            __IO  uint32_t  ADCMP_STA            :32;
        };
        struct {
            __IO  uint32_t  ADCMP_STA0           :1;
            __IO  uint32_t  ADCMP_STA1           :1;
            __IO  uint32_t  ADCMP_STA2           :1;
            __IO  uint32_t  ADCMP_STA3           :1;
            __IO  uint32_t  ADCMP_STA4           :1;
            __IO  uint32_t  ADCMP_STA5           :1;
            __IO  uint32_t  ADCMP_STA6           :1;
            __IO  uint32_t  ADCMP_STA7           :1;
            __IO  uint32_t  ADCMP_STA8           :1;
            __IO  uint32_t  ADCMP_STA9           :1;
            __IO  uint32_t  ADCMP_STA10          :1;
            __IO  uint32_t  ADCMP_STA11          :1;
            __IO  uint32_t  ADCMP_STA12          :1;
            __IO  uint32_t  ADCMP_STA13          :1;
            __IO  uint32_t  ADCMP_STA14          :1;
            __IO  uint32_t  ADCMP_STA15          :1;
            __IO  uint32_t  ADCMP_STA16          :1;
            __IO  uint32_t  ADCMP_STA17          :1;
            __IO  uint32_t  ADCMP_STA18          :1;
            __IO  uint32_t  ADCMP_STA19          :1;
            __IO  uint32_t  ADCMP_STA20          :1;
            __IO  uint32_t  ADCMP_STA21          :1;
            __IO  uint32_t  ADCMP_STA22          :1;
            __IO  uint32_t  ADCMP_STA23          :1;
            __IO  uint32_t  ADCMP_STA24          :1;
            __IO  uint32_t  ADCMP_STA25          :1;
            __IO  uint32_t  ADCMP_STA26          :1;
            __IO  uint32_t  ADCMP_STA27          :1;
            __IO  uint32_t  ADCMP_STA28          :1;
            __IO  uint32_t  ADCMP_STA29          :1;
            __IO  uint32_t  ADCMP_STA30          :1;
            __IO  uint32_t  ADCMP_STA31          :1;
        };
    };
} stc_mtb_dwt_cmp_addr_start_field_t;

typedef struct stc_mtb_dwt_cmp_data_start_field
{
    union {
        struct {
            __IO  uint32_t  DTCMP_STA            :32;
        };
        struct {
            __IO  uint32_t  DTCMP_STA0           :1;
            __IO  uint32_t  DTCMP_STA1           :1;
            __IO  uint32_t  DTCMP_STA2           :1;
            __IO  uint32_t  DTCMP_STA3           :1;
            __IO  uint32_t  DTCMP_STA4           :1;
            __IO  uint32_t  DTCMP_STA5           :1;
            __IO  uint32_t  DTCMP_STA6           :1;
            __IO  uint32_t  DTCMP_STA7           :1;
            __IO  uint32_t  DTCMP_STA8           :1;
            __IO  uint32_t  DTCMP_STA9           :1;
            __IO  uint32_t  DTCMP_STA10          :1;
            __IO  uint32_t  DTCMP_STA11          :1;
            __IO  uint32_t  DTCMP_STA12          :1;
            __IO  uint32_t  DTCMP_STA13          :1;
            __IO  uint32_t  DTCMP_STA14          :1;
            __IO  uint32_t  DTCMP_STA15          :1;
            __IO  uint32_t  DTCMP_STA16          :1;
            __IO  uint32_t  DTCMP_STA17          :1;
            __IO  uint32_t  DTCMP_STA18          :1;
            __IO  uint32_t  DTCMP_STA19          :1;
            __IO  uint32_t  DTCMP_STA20          :1;
            __IO  uint32_t  DTCMP_STA21          :1;
            __IO  uint32_t  DTCMP_STA22          :1;
            __IO  uint32_t  DTCMP_STA23          :1;
            __IO  uint32_t  DTCMP_STA24          :1;
            __IO  uint32_t  DTCMP_STA25          :1;
            __IO  uint32_t  DTCMP_STA26          :1;
            __IO  uint32_t  DTCMP_STA27          :1;
            __IO  uint32_t  DTCMP_STA28          :1;
            __IO  uint32_t  DTCMP_STA29          :1;
            __IO  uint32_t  DTCMP_STA30          :1;
            __IO  uint32_t  DTCMP_STA31          :1;
        };
    };
} stc_mtb_dwt_cmp_data_start_field_t;

typedef struct stc_mtb_dwt_cmp_mask_start_field
{
    union {
        struct {
            __IO  uint32_t  MSK_STA              :32;
        };
        struct {
            __IO  uint32_t  MSK_STA0             :1;
            __IO  uint32_t  MSK_STA1             :1;
            __IO  uint32_t  MSK_STA2             :1;
            __IO  uint32_t  MSK_STA3             :1;
            __IO  uint32_t  MSK_STA4             :1;
            __IO  uint32_t  MSK_STA5             :1;
            __IO  uint32_t  MSK_STA6             :1;
            __IO  uint32_t  MSK_STA7             :1;
            __IO  uint32_t  MSK_STA8             :1;
            __IO  uint32_t  MSK_STA9             :1;
            __IO  uint32_t  MSK_STA10            :1;
            __IO  uint32_t  MSK_STA11            :1;
            __IO  uint32_t  MSK_STA12            :1;
            __IO  uint32_t  MSK_STA13            :1;
            __IO  uint32_t  MSK_STA14            :1;
            __IO  uint32_t  MSK_STA15            :1;
            __IO  uint32_t  MSK_STA16            :1;
            __IO  uint32_t  MSK_STA17            :1;
            __IO  uint32_t  MSK_STA18            :1;
            __IO  uint32_t  MSK_STA19            :1;
            __IO  uint32_t  MSK_STA20            :1;
            __IO  uint32_t  MSK_STA21            :1;
            __IO  uint32_t  MSK_STA22            :1;
            __IO  uint32_t  MSK_STA23            :1;
            __IO  uint32_t  MSK_STA24            :1;
            __IO  uint32_t  MSK_STA25            :1;
            __IO  uint32_t  MSK_STA26            :1;
            __IO  uint32_t  MSK_STA27            :1;
            __IO  uint32_t  MSK_STA28            :1;
            __IO  uint32_t  MSK_STA29            :1;
            __IO  uint32_t  MSK_STA30            :1;
            __IO  uint32_t  MSK_STA31            :1;
        };
    };
} stc_mtb_dwt_cmp_mask_start_field_t;

typedef struct stc_mtb_dwt_cmp_addr_stop_field
{
    union {
        struct {
            __IO  uint32_t  ADCMP_STO            :32;
        };
        struct {
            __IO  uint32_t  ADCMP_STO0           :1;
            __IO  uint32_t  ADCMP_STO1           :1;
            __IO  uint32_t  ADCMP_STO2           :1;
            __IO  uint32_t  ADCMP_STO3           :1;
            __IO  uint32_t  ADCMP_STO4           :1;
            __IO  uint32_t  ADCMP_STO5           :1;
            __IO  uint32_t  ADCMP_STO6           :1;
            __IO  uint32_t  ADCMP_STO7           :1;
            __IO  uint32_t  ADCMP_STO8           :1;
            __IO  uint32_t  ADCMP_STO9           :1;
            __IO  uint32_t  ADCMP_STO10          :1;
            __IO  uint32_t  ADCMP_STO11          :1;
            __IO  uint32_t  ADCMP_STO12          :1;
            __IO  uint32_t  ADCMP_STO13          :1;
            __IO  uint32_t  ADCMP_STO14          :1;
            __IO  uint32_t  ADCMP_STO15          :1;
            __IO  uint32_t  ADCMP_STO16          :1;
            __IO  uint32_t  ADCMP_STO17          :1;
            __IO  uint32_t  ADCMP_STO18          :1;
            __IO  uint32_t  ADCMP_STO19          :1;
            __IO  uint32_t  ADCMP_STO20          :1;
            __IO  uint32_t  ADCMP_STO21          :1;
            __IO  uint32_t  ADCMP_STO22          :1;
            __IO  uint32_t  ADCMP_STO23          :1;
            __IO  uint32_t  ADCMP_STO24          :1;
            __IO  uint32_t  ADCMP_STO25          :1;
            __IO  uint32_t  ADCMP_STO26          :1;
            __IO  uint32_t  ADCMP_STO27          :1;
            __IO  uint32_t  ADCMP_STO28          :1;
            __IO  uint32_t  ADCMP_STO29          :1;
            __IO  uint32_t  ADCMP_STO30          :1;
            __IO  uint32_t  ADCMP_STO31          :1;
        };
    };
} stc_mtb_dwt_cmp_addr_stop_field_t;

typedef struct stc_mtb_dwt_cmp_data_stop_field
{
    union {
        struct {
            __IO  uint32_t  DTCMP_STO            :32;
        };
        struct {
            __IO  uint32_t  DTCMP_STO0           :1;
            __IO  uint32_t  DTCMP_STO1           :1;
            __IO  uint32_t  DTCMP_STO2           :1;
            __IO  uint32_t  DTCMP_STO3           :1;
            __IO  uint32_t  DTCMP_STO4           :1;
            __IO  uint32_t  DTCMP_STO5           :1;
            __IO  uint32_t  DTCMP_STO6           :1;
            __IO  uint32_t  DTCMP_STO7           :1;
            __IO  uint32_t  DTCMP_STO8           :1;
            __IO  uint32_t  DTCMP_STO9           :1;
            __IO  uint32_t  DTCMP_STO10          :1;
            __IO  uint32_t  DTCMP_STO11          :1;
            __IO  uint32_t  DTCMP_STO12          :1;
            __IO  uint32_t  DTCMP_STO13          :1;
            __IO  uint32_t  DTCMP_STO14          :1;
            __IO  uint32_t  DTCMP_STO15          :1;
            __IO  uint32_t  DTCMP_STO16          :1;
            __IO  uint32_t  DTCMP_STO17          :1;
            __IO  uint32_t  DTCMP_STO18          :1;
            __IO  uint32_t  DTCMP_STO19          :1;
            __IO  uint32_t  DTCMP_STO20          :1;
            __IO  uint32_t  DTCMP_STO21          :1;
            __IO  uint32_t  DTCMP_STO22          :1;
            __IO  uint32_t  DTCMP_STO23          :1;
            __IO  uint32_t  DTCMP_STO24          :1;
            __IO  uint32_t  DTCMP_STO25          :1;
            __IO  uint32_t  DTCMP_STO26          :1;
            __IO  uint32_t  DTCMP_STO27          :1;
            __IO  uint32_t  DTCMP_STO28          :1;
            __IO  uint32_t  DTCMP_STO29          :1;
            __IO  uint32_t  DTCMP_STO30          :1;
            __IO  uint32_t  DTCMP_STO31          :1;
        };
    };
} stc_mtb_dwt_cmp_data_stop_field_t;

typedef struct stc_mtb_dwt_cmp_mask_stop_field
{
    union {
        struct {
            __IO  uint32_t  MSK_STO              :32;
        };
        struct {
            __IO  uint32_t  MSK_STO0             :1;
            __IO  uint32_t  MSK_STO1             :1;
            __IO  uint32_t  MSK_STO2             :1;
            __IO  uint32_t  MSK_STO3             :1;
            __IO  uint32_t  MSK_STO4             :1;
            __IO  uint32_t  MSK_STO5             :1;
            __IO  uint32_t  MSK_STO6             :1;
            __IO  uint32_t  MSK_STO7             :1;
            __IO  uint32_t  MSK_STO8             :1;
            __IO  uint32_t  MSK_STO9             :1;
            __IO  uint32_t  MSK_STO10            :1;
            __IO  uint32_t  MSK_STO11            :1;
            __IO  uint32_t  MSK_STO12            :1;
            __IO  uint32_t  MSK_STO13            :1;
            __IO  uint32_t  MSK_STO14            :1;
            __IO  uint32_t  MSK_STO15            :1;
            __IO  uint32_t  MSK_STO16            :1;
            __IO  uint32_t  MSK_STO17            :1;
            __IO  uint32_t  MSK_STO18            :1;
            __IO  uint32_t  MSK_STO19            :1;
            __IO  uint32_t  MSK_STO20            :1;
            __IO  uint32_t  MSK_STO21            :1;
            __IO  uint32_t  MSK_STO22            :1;
            __IO  uint32_t  MSK_STO23            :1;
            __IO  uint32_t  MSK_STO24            :1;
            __IO  uint32_t  MSK_STO25            :1;
            __IO  uint32_t  MSK_STO26            :1;
            __IO  uint32_t  MSK_STO27            :1;
            __IO  uint32_t  MSK_STO28            :1;
            __IO  uint32_t  MSK_STO29            :1;
            __IO  uint32_t  MSK_STO30            :1;
            __IO  uint32_t  MSK_STO31            :1;
        };
    };
} stc_mtb_dwt_cmp_mask_stop_field_t;

typedef struct stc_mtb_dwt_fct_field
{
    union {
        struct {
            __IO   uint8_t  STAEN                :2;
            __IO   uint8_t  STPEN                :2;
            __IO   uint8_t  DSTA                 :2;
            __IO   uint8_t  DSTP                 :2;
        };
        struct {
            __IO   uint8_t  STAEN0               :1;
            __IO   uint8_t  STAEN1               :1;
            __IO   uint8_t  STPEN0               :1;
            __IO   uint8_t  STPEN1               :1;
            __IO   uint8_t  DSTA0                :1;
            __IO   uint8_t  DSTA1                :1;
            __IO   uint8_t  DSTP0                :1;
            __IO   uint8_t  DSTP1                :1;
        };
    };
} stc_mtb_dwt_fct_field_t;

typedef struct stc_mtb_dwt_pid4_field
{
    union {
        struct {
            __IO  uint32_t  PERID                :32;
        };
        struct {
            __IO  uint32_t  PERID0               :1;
            __IO  uint32_t  PERID1               :1;
            __IO  uint32_t  PERID2               :1;
            __IO  uint32_t  PERID3               :1;
            __IO  uint32_t  PERID4               :1;
            __IO  uint32_t  PERID5               :1;
            __IO  uint32_t  PERID6               :1;
            __IO  uint32_t  PERID7               :1;
            __IO  uint32_t  PERID8               :1;
            __IO  uint32_t  PERID9               :1;
            __IO  uint32_t  PERID10              :1;
            __IO  uint32_t  PERID11              :1;
            __IO  uint32_t  PERID12              :1;
            __IO  uint32_t  PERID13              :1;
            __IO  uint32_t  PERID14              :1;
            __IO  uint32_t  PERID15              :1;
            __IO  uint32_t  PERID16              :1;
            __IO  uint32_t  PERID17              :1;
            __IO  uint32_t  PERID18              :1;
            __IO  uint32_t  PERID19              :1;
            __IO  uint32_t  PERID20              :1;
            __IO  uint32_t  PERID21              :1;
            __IO  uint32_t  PERID22              :1;
            __IO  uint32_t  PERID23              :1;
            __IO  uint32_t  PERID24              :1;
            __IO  uint32_t  PERID25              :1;
            __IO  uint32_t  PERID26              :1;
            __IO  uint32_t  PERID27              :1;
            __IO  uint32_t  PERID28              :1;
            __IO  uint32_t  PERID29              :1;
            __IO  uint32_t  PERID30              :1;
            __IO  uint32_t  PERID31              :1;
        };
    };
} stc_mtb_dwt_pid4_field_t;

typedef struct stc_mtb_dwt_pid5_field
{
    union {
        struct {
            __IO  uint32_t  PERID                :32;
        };
        struct {
            __IO  uint32_t  PERID0               :1;
            __IO  uint32_t  PERID1               :1;
            __IO  uint32_t  PERID2               :1;
            __IO  uint32_t  PERID3               :1;
            __IO  uint32_t  PERID4               :1;
            __IO  uint32_t  PERID5               :1;
            __IO  uint32_t  PERID6               :1;
            __IO  uint32_t  PERID7               :1;
            __IO  uint32_t  PERID8               :1;
            __IO  uint32_t  PERID9               :1;
            __IO  uint32_t  PERID10              :1;
            __IO  uint32_t  PERID11              :1;
            __IO  uint32_t  PERID12              :1;
            __IO  uint32_t  PERID13              :1;
            __IO  uint32_t  PERID14              :1;
            __IO  uint32_t  PERID15              :1;
            __IO  uint32_t  PERID16              :1;
            __IO  uint32_t  PERID17              :1;
            __IO  uint32_t  PERID18              :1;
            __IO  uint32_t  PERID19              :1;
            __IO  uint32_t  PERID20              :1;
            __IO  uint32_t  PERID21              :1;
            __IO  uint32_t  PERID22              :1;
            __IO  uint32_t  PERID23              :1;
            __IO  uint32_t  PERID24              :1;
            __IO  uint32_t  PERID25              :1;
            __IO  uint32_t  PERID26              :1;
            __IO  uint32_t  PERID27              :1;
            __IO  uint32_t  PERID28              :1;
            __IO  uint32_t  PERID29              :1;
            __IO  uint32_t  PERID30              :1;
            __IO  uint32_t  PERID31              :1;
        };
    };
} stc_mtb_dwt_pid5_field_t;

typedef struct stc_mtb_dwt_pid6_field
{
    union {
        struct {
            __IO  uint32_t  PERID                :32;
        };
        struct {
            __IO  uint32_t  PERID0               :1;
            __IO  uint32_t  PERID1               :1;
            __IO  uint32_t  PERID2               :1;
            __IO  uint32_t  PERID3               :1;
            __IO  uint32_t  PERID4               :1;
            __IO  uint32_t  PERID5               :1;
            __IO  uint32_t  PERID6               :1;
            __IO  uint32_t  PERID7               :1;
            __IO  uint32_t  PERID8               :1;
            __IO  uint32_t  PERID9               :1;
            __IO  uint32_t  PERID10              :1;
            __IO  uint32_t  PERID11              :1;
            __IO  uint32_t  PERID12              :1;
            __IO  uint32_t  PERID13              :1;
            __IO  uint32_t  PERID14              :1;
            __IO  uint32_t  PERID15              :1;
            __IO  uint32_t  PERID16              :1;
            __IO  uint32_t  PERID17              :1;
            __IO  uint32_t  PERID18              :1;
            __IO  uint32_t  PERID19              :1;
            __IO  uint32_t  PERID20              :1;
            __IO  uint32_t  PERID21              :1;
            __IO  uint32_t  PERID22              :1;
            __IO  uint32_t  PERID23              :1;
            __IO  uint32_t  PERID24              :1;
            __IO  uint32_t  PERID25              :1;
            __IO  uint32_t  PERID26              :1;
            __IO  uint32_t  PERID27              :1;
            __IO  uint32_t  PERID28              :1;
            __IO  uint32_t  PERID29              :1;
            __IO  uint32_t  PERID30              :1;
            __IO  uint32_t  PERID31              :1;
        };
    };
} stc_mtb_dwt_pid6_field_t;

typedef struct stc_mtb_dwt_pid7_field
{
    union {
        struct {
            __IO  uint32_t  PERID                :32;
        };
        struct {
            __IO  uint32_t  PERID0               :1;
            __IO  uint32_t  PERID1               :1;
            __IO  uint32_t  PERID2               :1;
            __IO  uint32_t  PERID3               :1;
            __IO  uint32_t  PERID4               :1;
            __IO  uint32_t  PERID5               :1;
            __IO  uint32_t  PERID6               :1;
            __IO  uint32_t  PERID7               :1;
            __IO  uint32_t  PERID8               :1;
            __IO  uint32_t  PERID9               :1;
            __IO  uint32_t  PERID10              :1;
            __IO  uint32_t  PERID11              :1;
            __IO  uint32_t  PERID12              :1;
            __IO  uint32_t  PERID13              :1;
            __IO  uint32_t  PERID14              :1;
            __IO  uint32_t  PERID15              :1;
            __IO  uint32_t  PERID16              :1;
            __IO  uint32_t  PERID17              :1;
            __IO  uint32_t  PERID18              :1;
            __IO  uint32_t  PERID19              :1;
            __IO  uint32_t  PERID20              :1;
            __IO  uint32_t  PERID21              :1;
            __IO  uint32_t  PERID22              :1;
            __IO  uint32_t  PERID23              :1;
            __IO  uint32_t  PERID24              :1;
            __IO  uint32_t  PERID25              :1;
            __IO  uint32_t  PERID26              :1;
            __IO  uint32_t  PERID27              :1;
            __IO  uint32_t  PERID28              :1;
            __IO  uint32_t  PERID29              :1;
            __IO  uint32_t  PERID30              :1;
            __IO  uint32_t  PERID31              :1;
        };
    };
} stc_mtb_dwt_pid7_field_t;

