MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E1C12D0AGV20000/mcu.h
#define bFM_GPIO_PFR8_P0                          *((volatile  uint8_t *)(0x42660400UL))
#define bFM0P_GPIO_PFR8_P0                        *((volatile  uint8_t *)(0x42660400UL))
#define bFM_GPIO_PFR8_P1                          *((volatile  uint8_t *)(0x42660404UL))
#define bFM0P_GPIO_PFR8_P1                        *((volatile  uint8_t *)(0x42660404UL))

#define bFM_GPIO_PFRE_P2                          *((volatile  uint8_t *)(0x42660708UL))
#define bFM0P_GPIO_PFRE_P2                        *((volatile  uint8_t *)(0x42660708UL))
#define bFM_GPIO_PFRE_P3                          *((volatile  uint8_t *)(0x4266070CUL))
#define bFM0P_GPIO_PFRE_P3                        *((volatile  uint8_t *)(0x4266070CUL))

#define bFM_GPIO_PZR0_P0                          *((volatile  uint8_t *)(0x4266E000UL))
#define bFM0P_GPIO_PZR0_P0                        *((volatile  uint8_t *)(0x4266E000UL))
#define bFM_GPIO_PZR0_P1                          *((volatile  uint8_t *)(0x4266E004UL))
#define bFM0P_GPIO_PZR0_P1                        *((volatile  uint8_t *)(0x4266E004UL))
#define bFM_GPIO_PZR0_P2                          *((volatile  uint8_t *)(0x4266E008UL))
#define bFM0P_GPIO_PZR0_P2                        *((volatile  uint8_t *)(0x4266E008UL))
#define bFM_GPIO_PZR0_P3                          *((volatile  uint8_t *)(0x4266E00CUL))
#define bFM0P_GPIO_PZR0_P3                        *((volatile  uint8_t *)(0x4266E00CUL))
#define bFM_GPIO_PZR0_P5                          *((volatile  uint8_t *)(0x4266E014UL))
#define bFM0P_GPIO_PZR0_P5                        *((volatile  uint8_t *)(0x4266E014UL))
#define bFM_GPIO_PZR0_PB                          *((volatile  uint8_t *)(0x4266E02CUL))
#define bFM0P_GPIO_PZR0_PB                        *((volatile  uint8_t *)(0x4266E02CUL))
#define bFM_GPIO_PZR0_PC                          *((volatile  uint8_t *)(0x4266E030UL))
#define bFM0P_GPIO_PZR0_PC                        *((volatile  uint8_t *)(0x4266E030UL))
#define bFM_GPIO_PZR0_PF                          *((volatile  uint8_t *)(0x4266E03CUL))
#define bFM0P_GPIO_PZR0_PF                        *((volatile  uint8_t *)(0x4266E03CUL))

#define bFM_GPIO_PZR1_P0                          *((volatile  uint8_t *)(0x4266E080UL))
#define bFM0P_GPIO_PZR1_P0                        *((volatile  uint8_t *)(0x4266E080UL))
#define bFM_GPIO_PZR1_P1                          *((volatile  uint8_t *)(0x4266E084UL))
#define bFM0P_GPIO_PZR1_P1                        *((volatile  uint8_t *)(0x4266E084UL))
#define bFM_GPIO_PZR1_P2                          *((volatile  uint8_t *)(0x4266E088UL))
#define bFM0P_GPIO_PZR1_P2                        *((volatile  uint8_t *)(0x4266E088UL))
#define bFM_GPIO_PZR1_P3                          *((volatile  uint8_t *)(0x4266E08CUL))
#define bFM0P_GPIO_PZR1_P3                        *((volatile  uint8_t *)(0x4266E08CUL))
#define bFM_GPIO_PZR1_P4                          *((volatile  uint8_t *)(0x4266E090UL))
#define bFM0P_GPIO_PZR1_P4                        *((volatile  uint8_t *)(0x4266E090UL))
#define bFM_GPIO_PZR1_P5                          *((volatile  uint8_t *)(0x4266E094UL))
#define bFM0P_GPIO_PZR1_P5                        *((volatile  uint8_t *)(0x4266E094UL))
#define bFM_GPIO_PZR1_PA                          *((volatile  uint8_t *)(0x4266E0A8UL))
#define bFM0P_GPIO_PZR1_PA                        *((volatile  uint8_t *)(0x4266E0A8UL))
#define bFM_GPIO_PZR1_PB                          *((volatile  uint8_t *)(0x4266E0ACUL))
#define bFM0P_GPIO_PZR1_PB                        *((volatile  uint8_t *)(0x4266E0ACUL))
#define bFM_GPIO_PZR1_PC                          *((volatile  uint8_t *)(0x4266E0B0UL))
#define bFM0P_GPIO_PZR1_PC                        *((volatile  uint8_t *)(0x4266E0B0UL))
#define bFM_GPIO_PZR1_PD                          *((volatile  uint8_t *)(0x4266E0B4UL))
#define bFM0P_GPIO_PZR1_PD                        *((volatile  uint8_t *)(0x4266E0B4UL))
#define bFM_GPIO_PZR1_PE                          *((volatile  uint8_t *)(0x4266E0B8UL))
#define bFM0P_GPIO_PZR1_PE                        *((volatile  uint8_t *)(0x4266E0B8UL))
#define bFM_GPIO_PZR1_PF                          *((volatile  uint8_t *)(0x4266E0BCUL))
#define bFM0P_GPIO_PZR1_PF                        *((volatile  uint8_t *)(0x4266E0BCUL))

#define bFM_GPIO_PZR2_P1                          *((volatile  uint8_t *)(0x4266E104UL))
#define bFM0P_GPIO_PZR2_P1                        *((volatile  uint8_t *)(0x4266E104UL))
#define bFM_GPIO_PZR2_P2                          *((volatile  uint8_t *)(0x4266E108UL))
#define bFM0P_GPIO_PZR2_P2                        *((volatile  uint8_t *)(0x4266E108UL))
#define bFM_GPIO_PZR2_P3                          *((volatile  uint8_t *)(0x4266E10CUL))
#define bFM0P_GPIO_PZR2_P3                        *((volatile  uint8_t *)(0x4266E10CUL))

#define bFM_GPIO_PZR3_P0                          *((volatile  uint8_t *)(0x4266E180UL))
#define bFM0P_GPIO_PZR3_P0                        *((volatile  uint8_t *)(0x4266E180UL))
#define bFM_GPIO_PZR3_P1                          *((volatile  uint8_t *)(0x4266E184UL))
#define bFM0P_GPIO_PZR3_P1                        *((volatile  uint8_t *)(0x4266E184UL))
#define bFM_GPIO_PZR3_P2                          *((volatile  uint8_t *)(0x4266E188UL))
#define bFM0P_GPIO_PZR3_P2                        *((volatile  uint8_t *)(0x4266E188UL))
#define bFM_GPIO_PZR3_P3                          *((volatile  uint8_t *)(0x4266E18CUL))
#define bFM0P_GPIO_PZR3_P3                        *((volatile  uint8_t *)(0x4266E18CUL))
#define bFM_GPIO_PZR3_P4                          *((volatile  uint8_t *)(0x4266E190UL))
#define bFM0P_GPIO_PZR3_P4                        *((volatile  uint8_t *)(0x4266E190UL))
#define bFM_GPIO_PZR3_P5                          *((volatile  uint8_t *)(0x4266E194UL))
#define bFM0P_GPIO_PZR3_P5                        *((volatile  uint8_t *)(0x4266E194UL))
#define bFM_GPIO_PZR3_PA                          *((volatile  uint8_t *)(0x4266E1A8UL))
#define bFM0P_GPIO_PZR3_PA                        *((volatile  uint8_t *)(0x4266E1A8UL))
#define bFM_GPIO_PZR3_PB                          *((volatile  uint8_t *)(0x4266E1ACUL))
#define bFM0P_GPIO_PZR3_PB                        *((volatile  uint8_t *)(0x4266E1ACUL))
#define bFM_GPIO_PZR3_PC                          *((volatile  uint8_t *)(0x4266E1B0UL))
#define bFM0P_GPIO_PZR3_PC                        *((volatile  uint8_t *)(0x4266E1B0UL))
#define bFM_GPIO_PZR3_PD                          *((volatile  uint8_t *)(0x4266E1B4UL))
#define bFM0P_GPIO_PZR3_PD                        *((volatile  uint8_t *)(0x4266E1B4UL))
#define bFM_GPIO_PZR3_PE                          *((volatile  uint8_t *)(0x4266E1B8UL))
#define bFM0P_GPIO_PZR3_PE                        *((volatile  uint8_t *)(0x4266E1B8UL))
#define bFM_GPIO_PZR3_PF                          *((volatile  uint8_t *)(0x4266E1BCUL))
#define bFM0P_GPIO_PZR3_PF                        *((volatile  uint8_t *)(0x4266E1BCUL))

